ErpTest/src/Catalogs/ТранспортныеСредства/ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТранспортныеСредства</name>
  <basedOn>Catalog.ТипыТранспортныхСредств</basedOn>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаВид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаРегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицензионнаяКарточкаСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыТранспортныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоподъемностьВТоннах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВместимостьВКубическихМетрах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВместимостьПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатVIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатАвтоматическиСписыватьРасходТопливаНаЗапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>уатБалансоваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатВидМоделиТС</name>
    <type>
      <types>EnumRef.уатВидыМоделейТС</types>
    </type>
  </attributes>
  <attributes>
    <name>уатГабаритныйРазмерВысота</name>
    <comment>Габаритная высота (мм)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатГабаритныйРазмерДлина</name>
    <comment>Габаритная длина (мм)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатГабаритныйРазмерШирина</name>
    <comment>Габаритная ширина (мм)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_уатГараж</name>
    <comment>Гараж</comment>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>уатГаражныйНомер</name>
    <comment>Гаражный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатГодВыпуска</name>
    <comment>Год выпуска</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатДатаВводаВЭксплуатацию</name>
    <comment>Дата ввода в эксплуатацию</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатДатаВыбытия</name>
    <comment>Дата выбытия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатДатаПостановкиНаУчетГИБДД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатЗаполнятьПутевойЛистСпискомОборудования</name>
    <comment>Если установлен, то при вводе нового путевого листа и выборе ТС будет автоматически заполнен список оборудования и прицепов, привязанных к данному ТС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>уатИДвСистемеНавигации</name>
    <comment>Уникальный идентификатор ТС в системе навигации (GPS)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатИконкаНаКарте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатИспользуемаяСистемаGPS</name>
    <comment>Используемая система GPS</comment>
    <type>
      <types>EnumRef.уатСистемаGPS</types>
    </type>
  </attributes>
  <attributes>
    <name>уатКодПоКлассификатору</name>
    <comment>Код по классификатору видов ТС</comment>
    <type>
      <types>CatalogRef.уатКлассификаторВидыТранспортныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>уатКолонна</name>
    <comment>Колонна, к которой относится ТС</comment>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </attributes>
  <attributes>
    <name>уатКомментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>уатКоэффициентИзмененияНормТоплива</name>
    <comment>Значение задается в процентах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатМодель</name>
    <comment>Модель</comment>
    <type>
      <types>CatalogRef.уатМоделиТС</types>
    </type>
  </attributes>
  <attributes>
    <name>уатМодельДвигателя</name>
    <comment>Модель двигателя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатМощностьДвигателяКВт</name>
    <comment>Мощность двигателя, кВт.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатМощностьДвигателяЛС</name>
    <comment>Мощность двигателя (л.с.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатНачальнаяНаработка</name>
    <comment>Начальная наработка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатНачальныйПробег</name>
    <comment>Начальный пробег</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатНомерДвигателя</name>
    <comment>Номер двигателя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатНомерКПП</name>
    <comment>Номер коробки передач</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатНомерКузова</name>
    <comment>Номер кузова</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатНомерШасси</name>
    <comment>Номер шасси</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатОрганизация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>уатОбъектЭксплуатации</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>уатОсновноеУсловиеРаботы</name>
    <type>
      <types>CatalogRef.уатУсловияРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>уатОсновнойВидПЛ</name>
    <comment>Основной вид путевых листов</comment>
    <type>
      <types>EnumRef.уатВидыПЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>уатОсновнойРежимРаботы</name>
    <comment>Основной режим работы</comment>
    <type>
      <types>CatalogRef.уатРежимыРаботыТС</types>
    </type>
  </attributes>
  <attributes>
    <name>уатПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>уатПолезныйРазмерВысота</name>
    <comment>Полезная высота (мм)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатПолезныйРазмерДлина</name>
    <comment>Полезная длина (мм)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатПолезныйРазмерШирина</name>
    <comment>Полезная ширина (мм)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатСобственныйВес</name>
    <comment>Собственный вес, тонн</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатСрокИспользования</name>
    <comment>Срок полезного использования, мес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатТипТСПоВоенкомату</name>
    <comment>Тип ТС по военкомату</comment>
    <type>
      <types>CatalogRef.уатТипыТСПоВоенкомату</types>
    </type>
  </attributes>
  <attributes>
    <name>уатЦветКузова</name>
    <comment>Цвет кузова</comment>
    <type>
      <types>CatalogRef.уатЦвета</types>
    </type>
  </attributes>
  <attributes>
    <name>уатЦветМаршрутаНаКарте</name>
    <comment>B*256*256 + G*256 + R</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>пкКоэффициентЗагрузкиТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>пкНеУчитыватьВыработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>пкНеИспользоватьВЛогистике</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>пкСпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/Catalogs/ТранспортныеСредства/Forms/уатФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	////уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не Метаданные.Константы.Найти("ИспользоватьУправлениеДоставкой") = Неопределено Тогда 
		Если Не Константы.ИспользоватьУправлениеДоставкой.Получить() Тогда 
			Отказ = Истина;
			ТекстОшибки = "Для использования справочника ""Транспортные средства"" необходимо включить использование подсистемы ""Управление доставкой"" в панели ""Администрирование"", раздел ""Склад и доставка"".";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			УстановитьПривилегированныйРежим(Ложь);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ТекПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	мВремяДоОкончанияДействияДокументовТС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
		уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация"),
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ДниДоОкончанияДействияДокументовТС"));
	мВремяДоОкончанияДействияТопливныхКарт = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
		уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация"),
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ДниДоОкончанияДействияТопливныхКарт"));

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДниДоОкончанияДействияДокументовТС", мВремяДоОкончанияДействияДокументовТС);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаОкончания", ТекущаяДата());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДниДоОкончанияДействияТопливныхКарт", мВремяДоОкончанияДействияТопливныхКарт);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	Порядок = ЭтаФорма.Список.Порядок;
	Порядок.Элементы.Очистить();
	ЭлементПорядка = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.РежимОтображения =  РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.Использование = Истина;
	
	Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяОрганизация"),
			ПланыВидовХарактеристик.уатПраваИНастройки.ПредставлениеТСКакГосНомер) Тогда
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("уатГосударственныйНомер");
	Иначе
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("уатГаражныйНомер");
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.ОтборПодразделение, "ОтборОрганизация");
	
	ОбновитьНадписьПоРемонтам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	////уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	СтруктураНастроек = ВосстановитьНастройки();
	НастройкиНекорректны = (СтруктураНастроек = Неопределено ИЛИ ТипЗнч(СтруктураНастроек) <> Тип("Структура"));
	
	//отображение выбывших ТС
	Если НастройкиНекорректны ИЛИ (НЕ СтруктураНастроек.Свойство("ОтображатьВыбывшие")) Тогда
		ОтображатьВыбывшие = Ложь;
	Иначе
		ОтображатьВыбывшие = СтруктураНастроек.ОтображатьВыбывшие;
	КонецЕсли;
	Элементы.ФормаОтобразитьВыбывшие.Пометка = ОтображатьВыбывшие;
	УстановитьОтборВыбывшие();
	
	//нажмем кнопку при открытии, если после закрытия она осталась нажатой
	Если НастройкиНекорректны ИЛИ (НЕ СтруктураНастроек.Свойство("ОтображатьСтатусы")) Тогда
		ОтображатьСтатусы = Ложь;
	Иначе
		ОтображатьСтатусы = СтруктураНастроек.ОтображатьСтатусы;
	КонецЕсли;
	Элементы.ФормаОтображатьСтатусы.Пометка = ОтображатьСтатусы;
	УстановитьВидимостьСтатусов();
	
	//отображение строки доп. информации
	Если НастройкиНекорректны ИЛИ (НЕ СтруктураНастроек.Свойство("ОтображатьДопИнфо")) Тогда
		ОтображатьДопИнфо = Ложь;
	Иначе
		ОтображатьДопИнфо = СтруктураНастроек.ОтображатьДопИнфо;
	КонецЕсли;
	Элементы.ФормаПоказатьДопИнформацию.Пометка = ОтображатьДопИнфо;
	ОтобразитьСкрытьДопИнформацию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКолоннаПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборМодельТСПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипТСПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ПанельДопИнформацииПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.ПанельДопИнформацииПоТСПриНажатии(
		ЭтотОбъект, 
		Элемент, 
		ДанныеСобытия, 
		СтандартнаяОбработка,
		ТекущаяСтрока
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_СписокПриАктивизацииСтроки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ПросроченныеДокументы" И ВыбраннаяСтрока <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		Отбор = Новый Структура;
		Отбор.Вставить("ТС", ВыбраннаяСтрока);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		
		ОткрытьФорму("РегистрСведений.уатДокументыТС.ФормаСписка", ПараметрыФормы, Элемент);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтобразитьВыбывшие(Команда)
	Элементы.ФормаОтобразитьВыбывшие.Пометка = НЕ Элементы.ФормаОтобразитьВыбывшие.Пометка;
	УстановитьОтборВыбывшие();
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСтатусы(Команда)
	Элементы.ФормаОтображатьСтатусы.Пометка = НЕ Элементы.ФормаОтображатьСтатусы.Пометка;
	УстановитьВидимостьСтатусов();
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДопИнформацию(Команда)
	Элементы.ФормаПоказатьДопИнформацию.Пометка = НЕ Элементы.ФормаПоказатьДопИнформацию.Пометка;
	ОтобразитьСкрытьДопИнформацию();
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПланыРемонтов(Команда)
	
	уатОбщегоНазначения_проф.ОбновитьПланыРемонтныхРабот();
	ОбновитьНадписьПоРемонтам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьНадписьПоРемонтам()
	
	ДатаОбновленияПлана = Константы.уатДатаАктуальностиПланаРемонтныхРабот.Получить();
	
	Если НачалоДня(ДатаОбновленияПлана) <> НачалоДня(ТекущаяДата()) Тогда 
		Элементы.СостояниеОбновленияПлановРемонтов.Заголовок = "Данные по плану ремонтных работ не актуальны.";
	Иначе 
		Элементы.СостояниеОбновленияПлановРемонтов.Заголовок = "Данные по плану ремонтных работ обновлены в " + Формат(ДатаОбновленияПлана, "ДФ=HH:mm; ДП=00:00") + ".";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВосстановитьНастройки()
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить("Справочник.ТранспортныеСредства.Форма.уатФормаСписка", "ОбщиеНастройки");
	
	Возврат СтруктураНастроек;
КонецФункции

&НаСервере
Процедура СохранитьНастройки()
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ОтображатьВыбывшие", Элементы.ФормаОтобразитьВыбывшие.Пометка);
	СтруктураНастроек.Вставить("ОтображатьСтатусы" , Элементы.ФормаОтображатьСтатусы.Пометка);
	СтруктураНастроек.Вставить("ОтображатьДопИнфо" , Элементы.ФормаПоказатьДопИнформацию.Пометка);
	
	ХранилищеНастроекДанныхФорм.Сохранить("Справочник.ТранспортныеСредства.Форма.уатФормаСписка", "ОбщиеНастройки", СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВыбывшие()
	Если Элементы.ФормаОтобразитьВыбывшие.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатДатаВыбытия", '00010101',,, Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатДатаВыбытия", '00010101',,, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтатусов()
	Пометка = Элементы.ФормаОтображатьСтатусы.Пометка;
	Элементы.ТО.Видимость					 = Пометка;
	Элементы.ПросроченныеДокументы.Видимость = Пометка;
	Элементы.ГруппаОбновлениеПлановРемонтов.Видимость = Пометка;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	ОтобразитьСкрытьДопИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСкрытьДопИнформацию()
	
	флПоказатьДопИнфо = Элементы.ФормаПоказатьДопИнформацию.Пометка;
	Если флПоказатьДопИнфо И Не Элементы.ПанельДопИнформации.Видимость Тогда
		Элементы.ПанельДопИнформации.Видимость = Истина;
		
	ИначеЕсли Не флПоказатьДопИнфо И Элементы.ПанельДопИнформации.Видимость Тогда 
		Элементы.ПанельДопИнформации.Видимость = Ложь;
	КонецЕсли;
	
	Если флПоказатьДопИнфо Тогда
		Если Элементы.Список.ТекущаяСтрока = Неопределено Или ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			ПанельДопИнформации = "";
			Возврат;
		КонецЕсли;
		
		ПанельДопИнформации = ПолучитьТекстДопИнформации(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстДопИнформации(ТекТС)
	
	ДопускДней = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
		ТекТС.уатОрганизация,
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ДниДоОкончанияДействияДокументовТС")
	);
	
	ДниДоОкончанияДействияТК = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
		ТекТС.уатОрганизация,
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ДниДоОкончанияДействияТопливныхКарт")
	);
	
	Возврат уатОбщегоНазначения.СформироватьТекстДопИнформацииПоТС(
		ТекТС,
		Неопределено,
		Неопределено,
		ТекущаяДата(),
		ДопускДней,
		ДниДоОкончанияДействияТК
	);
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтбор()
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатОрганизация", ОтборОрганизация,,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатОрганизация",,,, Ложь);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборПодразделение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатПодразделение", ОтборПодразделение,,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатПодразделение",,,, Ложь);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборКолонна) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатКолонна", ОтборКолонна,,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатКолонна",,,, Ложь);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборМодельТС) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатМодель", ОтборМодельТС,,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "уатМодель",,,, Ложь);
	КонецЕсли;	
	Если ЗначениеЗаполнено(ОтборТипТС) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Тип", ОтборТипТС,,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Тип",,,, Ложь);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
